Config/Documents/ЗаписиОбИзмененииСведенийОбИмуществе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаписиОбИзмененииСведенийОбИмуществе</Name>
			<BasedOn>
				<xr:Item>Document.РегистрацияСведенийОбИмуществе</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектУчетаИмущества</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыУчетаСистемыУчетаИмущества</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписьОбИсключении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументИсточник</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РегистрацияСведенийОбИмуществе</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РегистрацияСведенийОбИмуществе</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеИзменений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобыеОтметки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыОснования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыРеестраИмущества</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/InformationRegisters/СведенияРеестровогоУчетаИмущества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СведенияРеестровогоУчетаИмущества</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РеестровыйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СистемныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектУчетаИмущества</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыУчетаСистемыУчетаИмущества</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Catalogs/ОбъектыРеестраИмущества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ОбъектыРеестраИмущества</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыОбъектовРеестраИмущества</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ЗначенияРеквизитов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РеквизитСведений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РеквизитыСведенийОбИмуществе</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ТипыРеквизитовСведенийОбИмуществе</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиТабличнойЧасти</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Documents/ЗаписиОбИзмененииСведенийОбИмуществе/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ЗаписиОбИзмененииСведенийОбИмуществе";
	КомандаПечати.Идентификатор		= "Записи";
	КомандаПечати.Представление		= НСтр("ru = 'Печать'");
	КомандаПечати.Порядок			= 1;
	
КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"Записи") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"Записи","Печать", ПечатьЗаписей(МассивОбъектов, ОбъектыПечати));		
	КонецЕсли;
	
КонецПроцедуры // Печать()

Функция ПечатьЗаписей(МассивОбъектов, ОбъектыПечати)
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ЗаписиОбИзмененииСведенийОбИмуществе.Организация.НаименованиеПолное = """"
	               |			ТОГДА ЗаписиОбИзмененииСведенийОбИмуществе.Организация.Наименование
	               |		ИНАЧЕ ЗаписиОбИзмененииСведенийОбИмуществе.Организация.НаименованиеПолное
	               |	КОНЕЦ КАК НаименованиеОрганизации,
	               |	ЗаписиОбИзмененииСведенийОбИмуществе.Дата,
	               |	ЗаписиОбИзмененииСведенийОбИмуществе.ОбъектУчетаИмущества,
	               |	ЗаписиОбИзмененииСведенийОбИмуществе.ЗаписьОбИсключении,
	               |	ЗаписиОбИзмененииСведенийОбИмуществе.СодержаниеИзменений,
	               |	ЗаписиОбИзмененииСведенийОбИмуществе.ОсобыеОтметки,
	               |	ЗаписиОбИзмененииСведенийОбИмуществе.Руководитель,
	               |	ЗаписиОбИзмененииСведенийОбИмуществе.ДокументыОснования.(
	               |		ДокументОснование
	               |	)
	               |ИЗ
	               |	Документ.ЗаписиОбИзмененииСведенийОбИмуществе КАК ЗаписиОбИзмененииСведенийОбИмуществе
	               |ГДЕ
	               |	ЗаписиОбИзмененииСведенийОбИмуществе.Ссылка В(&Документы)";
				   
	Запрос.УстановитьПараметр("Документы", МассивОбъектов); 				   
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат ТабДок;
	Конецесли;
	
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаписиОбИзмененииСведенийОбИмуществе.ПФ_MXL_Запись");
	
	Шапка				= Макет.ПолучитьОбласть("Шапка");
	Колонтитул			= Макет.ПолучитьОбласть("Колонтитул");
	Заголовок1			= Макет.ПолучитьОбласть("ЗаголовокИзмененияСведений");
	Заголовок2			= Макет.ПолучитьОбласть("ЗаголовокПрекращениеПрава");
	СодержаниеЗаписи	= Макет.ПолучитьОбласть("Содержание");
	ОснованиеЗаписи		= Макет.ПолучитьОбласть("Основание");
	ОсобыеОтметки		= Макет.ПолучитьОбласть("ОсобыеОтметки");
	ПодписьП			= Макет.ПолучитьОбласть("ПодписьП");
	ПодписьР			= Макет.ПолучитьОбласть("ПодписьР");
	
	ДанныеПечати = Новый Структура("ТабДок,Колонтитул,НомерСтраницы", ТабДок, Колонтитул, 1);
	
	ВыборкаШапка = Результат.Выбрать();
	
	Пока ВыборкаШапка.Следующий() Цикл
		
		Шапка.Параметры.НомерПриложения = ?(ВыборкаШапка.ЗаписьОбИсключении, "3", "2");
		ТабДок.Вывести(Шапка);
		
		НомерКарты = ПолучитьНомерКарты(ВыборкаШапка.ОбъектУчетаИмущества);
		Колонтитул.Параметры.НомерКарты = НомерКарты;
		Колонтитул.Параметры.Подраздел = Сред(НомерКарты, 1, 4);
		Колонтитул.Параметры.НомерСтраницы = 1;
		ТабДок.Вывести(Колонтитул);
			
		Если ВыборкаШапка.ЗаписьОбИсключении Тогда					
			ТабДок.Вывести(Заголовок2);
		Иначе
			ТабДок.Вывести(Заголовок1);
			СодержаниеЗаписи.Параметры.Содержание = ВыборкаШапка.СодержаниеИзменений;
			ВывестиОбласть(ДанныеПечати, СодержаниеЗаписи);
		КонецЕсли;
		
		ОснованиеЗаписи.Параметры.Документы = ПолучитьПредставлениеДокументов(ВыборкаШапка.ДокументыОснования.Выгрузить().ВыгрузитьКолонку("ДокументОснование"));
		ВывестиОбласть(ДанныеПечати, ОснованиеЗаписи);

		ОсобыеОтметки.Параметры.Отметки = ВыборкаШапка.ОсобыеОтметки;
		ВывестиОбласть(ДанныеПечати, ОсобыеОтметки);
				
		ПодписьП.Параметры.Организация = ВыборкаШапка.НаименованиеОрганизации; 
		ПодписьП.Параметры.Руководитель = Корреспонденты.ФИОПоОбъекту(ВыборкаШапка.Руководитель);
		ПодписьП.Параметры.РуководительДата = ВыборкаШапка.Дата;
		ВывестиОбласть(ДанныеПечати, ПодписьП);

		ВывестиОбласть(ДанныеПечати, ПодписьР);
		
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		
	КонецЦикла;
			
	Возврат ТабДок;
	
КонецФункции

Процедура ВывестиОбласть(ДанныеПечати, Область)
	
	ТабДок = ДанныеПечати.ТабДок; 
	
	Если Не ТабДок.ПроверитьВывод(Область) Тогда
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		ДанныеПечати.НомерСтраницы = ДанныеПечати.НомерСтраницы + 1;
		ДанныеПечати.Колонтитул.Параметры.НомерСтраницы = ДанныеПечати.НомерСтраницы;	
		ТабДок.Вывести(ДанныеПечати.Колонтитул);
	КонецЕсли;
	
	ТабДок.Вывести(Область);
	
КонецПроцедуры

Функция ПолучитьНомерКарты(ОбъектУчетаИмущества)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СведенияРеестровогоУчетаИмущества.НомерКарты
	               |ИЗ
	               |	РегистрСведений.СведенияРеестровогоУчетаИмущества КАК СведенияРеестровогоУчетаИмущества
	               |ГДЕ
	               |	СведенияРеестровогоУчетаИмущества.ОбъектУчетаИмущества = &ОбъектУчетаИмущества";
	
	Запрос.УстановитьПараметр("ОбъектУчетаИмущества", ОбъектУчетаИмущества);
	Выборка = Запрос.Выполнить().Выбрать();				   
	
	Возврат ?(Выборка.Следующий(), Выборка.НомерКарты, "");
	
КонецФункции

Функция ПолучитьПредставлениеДокументов(Документы)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Реквизиты.Ссылка,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА Реквизиты.РеквизитСведений.ИмяДляФормулы = ""Наименование""
	               |				ТОГДА Реквизиты.Значение
	               |			ИНАЧЕ NULL
	               |		КОНЕЦ) КАК Наименование,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА Реквизиты.РеквизитСведений.ИмяДляФормулы = ""ДатаДокумента""
	               |				ТОГДА Реквизиты.Значение
	               |			ИНАЧЕ NULL
	               |		КОНЕЦ) КАК ДатаДокумента,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА Реквизиты.РеквизитСведений.ИмяДляФормулы = ""НомерДокумента""
	               |				ТОГДА Реквизиты.Значение
	               |			ИНАЧЕ NULL
	               |		КОНЕЦ) КАК НомерДокумента,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА Реквизиты.РеквизитСведений.ИмяДляФормулы = ""Эмитент""
	               |				ТОГДА Реквизиты.Значение
	               |			ИНАЧЕ NULL
	               |		КОНЕЦ) КАК Эмитент
	               |ИЗ
	               |	Справочник.ОбъектыРеестраИмущества.ЗначенияРеквизитов КАК Реквизиты
	               |ГДЕ
	               |	Реквизиты.Ссылка В(&Документы)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Реквизиты.Ссылка";
				   
	Запрос.УстановитьПараметр("Документы", Документы);				   
	ДанныеДокументов = Запрос.Выполнить().Выгрузить();
				   
	Результат = Новый Массив;
	
	Для Каждого Документ Из Документы Цикл
		
		ДанныеДокумента = ДанныеДокументов.Найти(Документ, "Ссылка");
		Если ДанныеДокумента <> Неопределено Тогда
			Представление = ?(ЗначениеЗаполнено(ДанныеДокумента.Наименование), ДанныеДокумента.Наименование, "Документ") +
							?(ЗначениеЗаполнено(ДанныеДокумента.ДатаДокумента), " от "+ Формат(ДанныеДокумента.ДатаДокумента, "ДЛФ=Д"), "") +
							?(ЗначениеЗаполнено(ДанныеДокумента.НомерДокумента), " №"+ ДанныеДокумента.НомерДокумента, "") +
							?(ЗначениеЗаполнено(ДанныеДокумента.Эмитент), " выдан " + ДанныеДокумента.Эмитент, "");
			Результат.Добавить(Представление);	
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтрСоединить(Результат,  "; ");
		
КонецФункции

#КонецЕсли
